Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/irish_social_welfare_system/claiming_a_social_welfare_payment/taxation_of_social_welfare_payments.html.txt.tmx
Source language: en
Languages: ga

source: Taxation of social welfare payments
ga: Gearradh cánach ar íocaíochtaí leasa shóisialaigh

source: All income in Ireland is generally subject to taxation
ga: Go hiondúil, gearrtar cáin ar gach ioncam in Éirinn

source: Your social welfare payment may or may not be deemed taxable but even if your social welfare payment is taxable, you may not actually have to pay tax on it
ga: D'fhéadfadh d'íocaíocht leasa shóisialaigh a bheith inchánaithe nó saor ó cháin

source: If you are getting a social welfare payment you get a PAYE tax credit in addition to your normal tax credits
ga: Fiú má tá d'íocaíocht leasa shóisialaigh inchánaithe, tá seans fós ann nach n-íocfaidh tú cáin uirthi

source: This means, if a social welfare payment is your only source of income you may not pay tax because your tax liability does not exceed your tax credits
ga: Má tá tú ag fáil íocaíocht leasa shóisialaigh, gheobhaidh tú creidmheas cánach ÍMAT chomh maith leis na gnáth-chreidmheasanna cánach

source: The PAYE tax credit is given to the person claiming the social welfare payment and not to the adult dependant even if the Increase for a Qualified Adult is paid directly to the dependant
ga: Dá thoradh, más íocaíocht leasa shóisialaigh an t-aon foinse ioncaim atá agat, ní bheidh cáin le híoc agat toisc nach sáraíonn do dhliteanas cánach do chreidmheasanna cánach

source: Universal Social Charge and social insurance (PRSI) is not payable on social welfare payments
ga: Ní bhaineann an Muirear Sóisialta Uilíoch (MSU) le híocaíochtaí leasa shóisialaigh

source: Social welfare payment and another income
ga: Íocaíocht leasa shóisialaigh agus ioncam eile

source: If you have a social welfare payment and another source of income, you may have to pay tax
ga: Má tá íocaíocht leasa shóisialaigh chomh maith le foinse eile ioncaim agat, d'fhéadfadh sé go mbeadh cáin le n-íoc aige/aici

source: In this case, your taxable social welfare payment and your other income are added together
ga: Sa chás seo, beidh d’íocaíocht inchánaithe agus d’fhoinse eile ioncaim suimithe

source: You are taxed on the total amount
ga: Gearrtar cáin ar an méid iomlán

source: There is no mechanism for taxing social welfare payments at source (before it is paid to you)
ga: Níl aon bhealach i bhfeidhm le cáin a ghearradh ar phinsin leasa shóisalaigh ag an bhfoinse, i bhfocail eile, sula n-íoctar an pinsean leat

source: Your non-social welfare income determines how tax due is paid
ga: Braitheann an córas cánach ar an bhfoinse eile ioncaim atá agat

source: For example, you are getting a social welfare pension and an occupational pension
ga: Mar shampla, má tá íocaíocht leasa shóisialaigh agus pinsean gairme agat, gearrtar cáin air tríd an gcóras ÍMAT air, díreach mar an gcéanna leis an gcóras nuair a ghearrtar cáin ar phá nó tuarastal

source: Your occupational pension is taxed through the Pay-As-You-Earn (PAYE) system in the same way as a wage or salary
ga: Is ionann é seo agus a rá go bhfaigheann tú chreidmheasanna cánach sa ghnáthbhealach

source: This means that you get your tax credits in the normal way. In order to tax your social welfare pension, your annual tax credits are reduced by the tax liability on your social welfare pension
ga: Chun cáin a ghearradh ar an bpinsean leasa shóisialaigh, déantar scoithphointe an ráta chaighdeánaigh a laghdú faoi mhéid an phinsin leasa shóisialaigh agus déantar na creidmheasanna cánach a laghdú faoin dliteanas cánach ar an bpinsean leasa shóisialaigh

source: You then effectively pay tax on both the pensions, but it is collected from the occupational pension
ga: Mar sin, is amhlaidh go n-íoctar cáin ar an dá phinsean ach íoctar í tríd an bpinsean ceirde

source: The technical term for this is coding in of credits
ga: Tugtar "códú" creidmheasanna ar an nós seo

source: The same arrangement applies if you have income from a job and a social welfare payment
ga: Cuirtear an nós imeachta céanna i bhfeidhm má tá ioncam agat ó phost agus má tá pinsean leasa shóisialaigh aige/aici

source: If your social welfare payment was not coded in, you would have to pay tax as a self-employed person and in a lump sum by 31 October each year
ga: Muna mbeadh do phinsean leasa shóisialaigh curtha san áireamh sa bhealach seo, bheadh cáin le n-íoc air ina cnapshuim go bliantúil mar dhuine féinfhostaithe faoin 31 mí Dheireadh Fómhair

source: If your other source of income is not taxed through the PAYE system, for example, if you are self-employed, have an occupational pension from abroad or have investment income, then you are classed as a self-employed person and your tax is payable annually by 31 October each year
ga: Mura n-íocann tú cáin ar an bhfoinse ioncaim eile atá agat tríd an gcóras ÍMAT, cuir i gcás go bhfuil pinsean gairme ó thír thar lear nó ioncam infheistíochta agat, cuirtear tú san aicme féinfhostaithe agus ní mór an cháin a íoc ina cnapshuim go bliantúil roimh 31 Deireadh Fómhair

source: Social security pensions from abroad
ga: Pinsin leasa shóisialaigh nó pinsin slándála sóisialaí ó thír eile

source: If you have a social security pension from abroad, it is also generally taxable in Ireland
ga: Má tá pinsean slándála sóisialaí ó thír eile agat, is iondúil go bhfuil sé inchánaithe in Éirinn

source: The tax is payable annually unless you have a source of income that is subject to PAYE
ga: Ní mór an cháin a íoc go bliantúil mura bhfuil foinse ioncaim eile agat a thiteann faoin gcóras ÍMAT

source: Certain foreign pensions that would be exempt from tax if you were resident in the country paying the pension, are however also exempt from tax in Ireland
ga: Tá pinsin eachtrannacha áirithe a bheadh saor ó cháin dá mbeadh faighteoir an phinsin ina chónaí sa tír as atá an pinsean ag teacht agus mar sin tá siad saor ó cháin in Éirinn chomh maith

source: Universal Social Charge and PRSI are not payable
ga: Íocaíochtaí leasa shóisialaigh Éireannacha

source: The Department of Social Protection (DSP) will pay Maternity Benefit without any deduction of tax
ga: Bíonn Sochar Cuardaitheora Poist inchánaithe go ginearálta, ach bíonn an chéad €13 gach seachtain saor ó cháin

source: However the DSP will notify Revenue of the amount of Maternity Benefit to be taken into account for income tax purposes
ga: Níl Sochar Cuardaitheora Poist atá iníochta le hoibreoirí gearrthréimhseacha inchánaithe

source: If you are self-employed and pay your tax through the self-assessment system you should include details of any Maternity Benefit received in your annual tax return
ga: Níl Méaduithe i leith Leanaí Cáilithe atá iníochta le Sochar Cuardaitheora Poist, Sochar Breoiteachta agus an Scéim Díobhálacha Ceirde (Sochar Díobhála, Pinsean Míchumais agus Forlíonadh Easláinte) inchánaithe

source: If you pay tax through the PAYE system Revenue will, where possible, automatically reduce your annual tax credits and rate bands to account for the tax payable on your Maternity Benefit (see 'Further information' below for examples)
ga: Seachas na cásanna thuas, má tá d’íocaíocht leasa shóisialaigh inchánaithe, beidh aon mhéadú ar d’íocaíocht le haghaidh do chleithiúnaí aosaigh inchánaithe chomh maith

source: You can also read our case study
ga: Níl Sochar Linbh inchánaithe

source: If you were getting Maternity Benefit up to and including 30 June 2013 you may be entitled to a tax and PRSI refund if your Maternity Benefit is paid to your employer and your employer continues to pay your normal weekly wage
ga: Íocaíochtaí caomhnóra, arb íocaíochtaí iad a rinneadh ar mhaithe le dílleachta, inchánaithe

source: If this is the case, when your Maternity Benefit has finished, you can write to the Maternity Benefit Section or contact the Maternity Benefit Section online to request an MB21 Statement, which you should then forward to your tax office to get a tax refund
ga: Meastar gur réadmhaoin thairbhiúil an linbh íocaíocht chaomhnóra agus tá sé inmheasúnaithe, ar an ábhar sin, i leith a n-ioncaim (más ann dó), seachas i leith ioncam an duine a fhaigheann an íocaíocht chaomhnóra

source: They do this by including the taxable amount of Illness or Injury Benefit with the employee’s earnings
ga: │An Díbhinn Teaghlaigh um Fhilleadh ar │Saor ó cháin │ │Obair │ │

source: Jobseeker’s Benefit and One-Parent Family Payment
ga: │Liúntas Cuardaitheora Poist │Saor ó cháin │

source: One-Parent Family Payment is taxed in the same way
ga: │Socrú idirthréimhseach Liúntas │Saor ó cháin │

source: No PRSI or USC is payable
ga: │Cuardaitheora Poist │ │

source: Jobseeker's Benefit payable to short-time workers is not taxable
ga: │Liúntas Réamhscoir │Saor ó cháin │

source: Guardian's payments, which are payments made for the benefit of an orphan, are taxable
ga: │Cúnamh Feirme │Saor ó cháin │

source: Payments that are not taxed
ga: │Pinsean Baintrí, Baintrí Fir nó │ │

source: Back to Work Family Dividend Not taxed
ga: │Páirtnéara Shibhialta Mharthanaigh │Inchánaithe │

source: Disablement Gratuity (lump sum payment) Not taxed Domiciliary Care Allowance Not taxed
ga: │Íocaíocht Chaomhnóra (Neamhranníocach) │(ar ioncam │

source: Family Income Supplement Not taxed
ga: │Liúntas Cúramóra │Inchánaithe │

source: Fuel Allowance Not taxed
ga: │Liúntas Leasa Forlíontach │Saor ó cháin │

source: Household Benefits Scheme Not taxed
ga: │Pinsean Stáit (Neamhranníocach) │Inchánaithe │

source: Jobseeker's Allowance Not taxed
ga: │Pinsean na nDall │Inchánaithe │

source: Jobseeker's Transitional payment Not taxed
ga: │Liúntas Míchumais │Saor ó cháin │

source: Pre-Retirement Allowance Not taxed
ga: │Liúntas Banchéile Thréigthe │Inchánaithe │

source: Supplementary Welfare Allowance Not taxed
ga: │Íocaíocht Teaghlaigh Aontuismitheora │Inchánaithe │

source: Deserted Wife’s Allowance Taxable
ga: │Sochar Atharthachta │Inchánaithe │

source: Disablement Pension Taxable (except for child increases)
ga: │Sochar Breoiteachta │Inchánaithe (ach amháin │

source: Guardian's Payment (Contributory) Taxable (on child's income)
ga: │ │méadaithe cleithiúnaí linbh) │

source: Guardian's Payment (Non-Contributory) Taxable (on child's income)
ga: │Sochar Máithreachais │Inchánaithe (ón 1 Iúil 2013) │

source: Health and Safety Benefit Taxable (since 1 July 2013)
ga: │Sochar Uchtála │Inchánaithe (ón 1 Iúil 2013) │

source: Maternity Benefit Taxable (since 1 July 2013)
ga: │Sochar Sláinte agus Sábháilteachta │Inchánaithe (ón 1 Iúil 2013) │

source: One-Parent Family Payment Taxable
ga: │Pinsean Míchumais │Inchánaithe │

source: Partial Capacity Benefit Taxable
ga: │Sochar Cuardaitheora Poist │Inchánaithe (ach amháin │

source: State Pension (Contributory) Taxable
ga: │Liúntas Fiontraíochta Gearrthréimhseach │Inchánaithe │

source: State Pension (Non-Contributory) Taxable
ga: │hoibrithe gearr-ama) │ │

source: Widow’s, Widower’s or Surviving Civil Partner's (Contributory) Pension Taxable
ga: │Pinsean Baintrí, Baintrí Fir nó Páirtnéara │Inchánaithe │

source: Widow’s, Widower’s or Surviving Civil Partner's (Non-Contributory) Pension Taxable Other schemes
ga: │Shibhialta Mharthanaigh (Ranníocach) │ │

source: The Vocational Training Opportunities Scheme (VTOS) is not taxable
ga: │Íocaíocht Chaomhnóra (Ranníocach) │Inchánaithe (ar ioncam linbh) │

source: The Water Conservation Grant (paid annually to households registered with Irish Water) is exempt from income tax
ga: │Sochar Banchéile Thréigthe │Inchánaithe │

source: Payments made under the Community Employment scheme, Rural Social Scheme (RSS), Tús, Gateway and the Community Services Programme are taxable
ga: ├────────────────────────────────────────────────┼───────────────────────────────┤ │Sochar Cúramóra │Inchánaithe │

source: If the underlying payment is not taxable, JobBridge payments are not taxable
ga: │Sochar Cumais Pháirtigh │Inchánaithe │

source: You may get an increase in your social welfare payment, if you are living alone
ga: │Pinsean Stáit (Ranníocach │Inchánaithe │

source: If your social welfare payment is taxable, then the Living Alone Increase is taxable
ga: │Pinsean Stáit (Ranníocach) │Inchánaithe │

source: If your social welfare payment is not taxable, then your Living Alone Increase is not taxable
ga: │Liúntas Freastail Leanúnach ( Iníoctha le │Inchánaithe │

source: No tax is deducted at source by the Department of Social Protection
ga: │Sochar Gortaithe │Inchánaithe │

source: All enquiries about your tax liability should be addressed to your local tax office
ga: │Pinsean Sochair Báis │Inchánaithe │

source: If you pay tax through the PAYE system you will probably fall into one of the following 3 categories:
ga: Níl an Liúntas um Fhilleadh ar Obair; an Liúntas Fiontraíochta um Fhilleadh ar Obair agus an Liúntas um Fhilleadh ar Oideachas inchánaithe

source: Revenue will reduce your tax credits and rate band to account for the tax payable on your Maternity Benefit and in this way collect the tax due
ga: Níl íocaíochtaí a dhéanann an CGO faoin Scéim Deiseanna Oiliúna Ghairmoideachais (SDOG) inchánaithe

source: Revenue will then send a revised tax credit certificate to your employer
ga: Níl an Deontas Caomhnaithe Uisce inchánaithe

source: 2. You are paid your full or partial salary by your employer and your Maternity Benefit is paid directly to you
ga: Tá íocaíochtaí faoin Scéim Shóisialta Tuaithe (RSS), TÚS agus faoin gClár Seirbhísí Pobail inchánaithe

source: Revenue will reduce your tax credits and rate band to account for the tax payable on your Maternity Benefit and your employer should only deduct tax, USC and PRSI only on the amount of salary actually paid by them
ga: Tá íocaíochtaí a dhéantar faoi JobBridge, an Scéim Náisiúnta Intéirneachta, inchánach má tá an íocaíocht bhunúsach leasa shóisialaigh inchánach. Mura bhfuil an íocaíocht bhunúsach inchánach, nach bhfuil íocaíochtaí JobBridge inchánach

source: 3. You do not get any salary while on maternity leave and your Maternity Benefit is paid directly to you
ga: Má tá tú i do chónaí i d'aonar, d'fhéadfá méadú ar d'íocaíocht leasa shóisialaigh a fháil

source: Revenue will reduce your tax credits and rate band to account for the tax payable on your Maternity Benefit
ga: Má tá d'íocaíocht leasa shóisialaigh inchánaithe, tá anMéadú do Mhaireachtáil Aonair inchánaithe

source: If your only income is Maternity Benefit you will probably pay very little or no tax (since your total tax credits will probably exceed your total tax liability)
ga: Mura mbíonn d'íocaíocht leasa shóisialaigh inchánaithe, níl do Mhéadú do Mhaireachtáil Aonair inchánaithe

source: Alternatively, when you go back to work after maternity leave, any refund of tax which may be due can be calculated
ga: De ghnáth, níl an Liúntas Cúram Baile agus an Liúntas Breosla inchánaithe
